310/310.1.2soapdemo/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.perscholas.com/xml/book">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getBookRequest>
            <gs:id>2</gs:id>
        </gs:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>